<!--
    Descript-arm64.munki.recipe
    Downloads and imports Descript (Apple Silicon / arm64) into Munki.

    Maintainer: Brooke Miller (github.com/macbr00ke)
    Repo:       https://github.com/macbr00ke/your-recipes-repo
    Identifier: com.github.macbr00ke.munki.Descript.arm64

    ParentRecipe: com.github.haircut.download.Descript
    Depends on:   haircut-recipes (https://github.com/autopkg/haircut-recipes)

    Notes:
    - Imports Apple Silicon Descript into Munki.
    - Metadata (version, installs, name) is extracted dynamically.
    - ARCH is hard-coded to arm64.
-->
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
 "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.macbr00ke.munki.Descript_arm64</string>

    <key>Description</key>
    <string>Downloads and imports the latest Apple Silicon (arm64) Descript app into Munki.</string>

    <key>ParentRecipe</key>
    <string>com.github.haircut.download.Descript</string>

    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps/Descript</string>

        <key>ARCH</key>
        <string>arm64</string>

        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>Descript</string>
            <key>description</key>
            <string>Descript is an all-in-one video and podcast editing app.</string>
            <key>developer</key>
            <string>Descript Inc.</string>
            <key>category</key>
            <string>Audio/Video</string>
            <key>minimum_os_version</key>
            <string>11.0</string>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>unattended_install</key>
            <true/>
            <key>uninstall_method</key>
            <string>remove_copied_items</string>
            <key>supported_architectures</key>
            <array>
                <string>arm64</string>
            </array>
            <key>installs</key>
            <array>
                <dict>
                    <key>CFBundleIdentifier</key>
                    <string>com.descript.beachcube</string>
                    <key>CFBundleName</key>
                    <string>Descript</string>
                    <key>CFBundleShortVersionString</key>
                    <string>%version%</string>
                    <key>CFBundleVersion</key>
                    <string>%version%</string>
                    <key>minosversion</key>
                    <string>11.0</string>
                    <key>path</key>
                    <string>/Applications/Descript.app</string>
                    <key>type</key>
                    <string>application</string>
                    <key>version_comparison_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
            </array>
        </dict>
    </dict>

    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Descript.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>

        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
