<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports the latest version of Digital Photo Professional 4 into Munki.</string>
    <key>Identifier</key>
    <string>com.github.macbr00ke.munki.DigitalPhotoProfessional4</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps/Canon</string>
        <key>NAME</key>
        <string>DigitalPhotoProfessional4</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Digital Photo Professional 4.app</string>
                <string>Digital Photo Professional 4 Batch.app</string>
                <string>EOS Lens Registration Tool.app</string>
                <string>Dpp4HDRComposite.app</string>
                <string>Dpp4FocusStackingBatch.app</string>
                <string>Dpp4RawMovieBatch.app</string>
                <string>CameraSurveyProgram.app</string>
                <string>Dpp4HDRPQCompositeBatch.app</string>
                <string>CSATool.app</string>
                <string>Dpp4HDRPQComposite.app</string>
                <string>Dpp4Printer.app</string>
                <string>Dpp4Renamer.app</string>
                <string>Dpp4DPRAWTool.app</string>
                <string>Dpp4RAWBurstTool.app</string>
                <string>UpdaterDownloader.app</string>
                <string>Dpp4FocusStackingTool.app</string>
                <string>Dpp4ExpComposite.app</string>
                <string>CSATool-s01.app</string>
                <string>Dpp4RawMovieTool.app</string>
                <string>XE2XNRRXZ5.com.canon.Digital-Photo-Professional-4.Cloud-Develop.Beta.Dpp4XPCDCCHelper.app</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Digital Photo Professional is a genuine Canon application for viewing, selecting, and developing RAW images. By applying a range of image adjustments in Picture Style files you can quickly adjust your RAW images with freedom.</string>
            <key>developer</key>
            <string>Canon</string>
            <key>display_name</key>
            <string>Digital Photo Professional 4</string>
            <key>category</key>
            <string>Creative</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash
            
if [ -d "/Applications/Canon Utilities/Digital Photo Professional 4" ]; then
    rm -rf "/Applications/Canon Utilities/Digital Photo Professional 4"
fi

if [ -d "/Applications/Canon Utilities/EOS Lens Registration Tool" ]; then
    rm -rf "/Applications/Canon Utilities/EOS Lens Registration Tool"
fi

if [ -d "/Applications/Canon Utilities/CameraSurveyProgram" ]; then
    rm -rf "/Applications/Canon Utilities/CameraSurveyProgram"
fi

pkgutil --forget com.canon.Digital-Photo-Professional-4
pkgutil --forget com.canon.EOS-Lens-Registration-Tool
pkgutil --forget jp.co.canon.ic.CameraSurveyProgram
pkgutil --forget com.canon.CSATool

exit 0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.macbr00ke.download.DigitalPhotoProfessional4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%found_basename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
