<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Digital Photo Professional 4 and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.macbr00ke.munki.DigitalPhotoProfessional4</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps/Canon</string>
        <key>NAME</key>
        <string>DigitalPhotoProfessional4</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>XE2XNRRXZ5.com.canon.Digital-Photo-Professional-4.Cloud-Develop.Beta.Dpp4XPCDCCHelper.app</string>
                <string>Dpp4HDRComposite.app</string>
                <string>Dpp4FocusStackingBatch.app</string>
                <string>Dpp4RawMovieBatch.app</string>
                <string>CameraSurveyProgram.app</string>
                <string>Dpp4HDRPQCompositeBatch.app</string>
                <string>CSATool.app</string>
                <string>Dpp4HDRPQComposite.app</string>
                <string>Dpp4Printer.app</string>
                <string>Dpp4Renamer.app</string>
                <string>Digital Photo Professional 4 Batch.app</string>
                <string>Dpp4DPRAWTool.app</string>
                <string>Dpp4RAWBurstTool.app</string>
                <string>UpdaterDownloader.app</string>
                <string>Dpp4FocusStackingTool.app</string>
                <string>Dpp4ExpComposite.app</string>
                <string>CSATool-s01.app</string>
                <string>Dpp4RawMovieTool.app</string>
                <string>Digital Photo Professional 4.app</string>
                <string>EOS Lens Registration Tool.app</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Professional photo management application for viewing, selecting, and developing RAW images.</string>
            <key>category</key>
            <string>Creative</string>
            <key>developer</key>
            <string>Canon</string>
            <key>display_name</key>
            <string>Digital Photo Professional 4</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.macbr00ke.download.DigitalPhotoProfessional4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>additional_makepkginfo_options</key>
                <array>
                    <string>--version</string>
                    <string>%version%</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
