<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot). Customized with Gemini's help to fix permission and uninstall issues.</string>
    <key>Description</key>
    <string>Downloads the latest AMPL for Academics and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.macbr00ke.munki.AMPL4A</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps/AMPL</string>
        <key>NAME</key>
        <string>AMPL4A</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>AMPL IDE.app</string>
                <string>AMPL Activation.app</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Math &amp; Science</string>
            <key>description</key>
            <string>AMPL is a high-level modeling system for solving complex optimization problems. AMPL for Academics provides students, faculty, and researchers full AMPL functionality with academic access to select commercial solvers - ideal for coursework, thesis projects, and scholarly research. Requires free academic license.</string>
            <key>developer</key>
            <string>AMPL Optimization Inc.</string>
            <key>display_name</key>
            <string>AMPL for Academics</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>installs</key>
            <array>
                <dict>
                    <key>path</key>
                    <string>/Applications/AMPL/AMPL IDE.app</string>
                    <key>type</key>
                    <string>application</string>
                    <key>version_comparison_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
                <dict>
                    <key>path</key>
                    <string>/Applications/AMPL/AMPL Activation.app</string>
                    <key>type</key>
                    <string>application</string>
                </dict>
            </array>
            <key>postinstall_script</key>
            <string>#!/bin/bash
AMPL_PATH="/Applications/AMPL"
if [ -d "$AMPL_PATH" ]; then
    # Fix the executable bits that cause the "Cannot be launched" error
    /bin/chmod -R +rX "$AMPL_PATH"
    # Ensure any user can write the license/env files in the shared folder
    /bin/chmod -R 777 "$AMPL_PATH"
    # Strip quarantine to bypass Gatekeeper prompts on script-unpacked apps
    /usr/bin/xattr -rd com.apple.quarantine "$AMPL_PATH" 2&gt;/dev/null
fi
exit 0
            </string>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
            <key>uninstall_script</key>
            <string>#!/bin/bash
/usr/bin/killall "AMPL IDE" 2&gt;/dev/null
/usr/bin/killall "AMPL Activation" 2&gt;/dev/null
if [ -d "/Applications/AMPL" ]; then
    /bin/rm -rf "/Applications/AMPL"
fi
/usr/sbin/pkgutil --forget com.ampl.amplide 2&gt;/dev/null
/usr/sbin/pkgutil --forget com.ampl 2&gt;/dev/null
exit 0
            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.macbr00ke.download.AMPL4A</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>munkiimport_pkgname</key>
                <string>AMPLInstaller.pkg</string> 
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
